INSERT INTO schema_14 (first_name, middle_name, last_name, email) values
('Иван', 'Иванович', 'Иванов', 'ivanov@my.example.com'),
('Петр', 'Петрович', 'Петров','petrov@my.example.com'),
('Иван', 'Петрович', 'Сидоров', 'sidorov@my.example.com'),
('Ягьяева', 'Сабрина', 'Серверовна', 'sabrina@my.example.com'),
( 'Сергей', 'Александрович', 'Сергеев', 'sergeev@my.example.com'),
('Дмитрий', 'Олегович', 'Смирнов', 'smirnov@my.example.com'),
('Алексей', 'Викторович', 'Кузнецов', 'kuznetsov@my.example.com'),
('Николай', 'Андреевич', 'Попов','popov@my. example.com' ),
('Михаил', 'Денисович', 'Соколов','sokolov@my.example.com'),
('Андрей', 'Максимович', 'Волков', 'volkov@my.example.com'),
('Мария', 'Алексеевна', 'Орлова', 'orlova@my.example.com'),
('Тимофей', 'Романович', 'Беляев', 'belyaev@my.example.com'),
('Ольга', 'Владимировна', 'Морозова', 'morozova@my.example.com'),
('Егор', 'Станиславович', 'Фёдоров', 'fedorov@my.example.com'),
('Никита', 'Павлович', 'Громов', 'gromov@my.example.com'),
('Алина', 'Дмитриевна', 'Лебедева', 'lebedeva@my.example.com'),
('Владислав', 'Игоревич', 'Тарасов', 'tarasov@my.example.com'),
('Екатерина', 'Сергеевна', 'Зайцева', 'zaitseva@my.example.com'),
('Роман', 'Андреевич', 'Киселёв', 'kiselev@my.example.com'),
('Дарья', 'Алексеевна', 'Панина', 'panina@my.example.com'),
('Максим', 'Витальевич', 'Богданов', 'bogdanov@my.example.com'),
('Артём', 'Константинович', 'Жуков', 'zhukov@my.example.com'),
('Светлана', 'Олеговна', 'Фролова', 'frolova@my.example.com'),
('Илья', 'Николаевич', 'Ершов', 'ershov@my.example.com');


-- Пользователи с 1 адресом
INSERT INTO address (user_id, zip_code, city, street, building, flat) VALUES
(1, '101000', 'Москва', 'Ленина', '10', '1'),
(2, '101001', 'Москва', 'Пушкина', '12', '5'),
(3, '101002', 'Москва', 'Гагарина', '7', '12'),
(4, '101003', 'Москва', 'Мира', '3', '8'),
(5, '101004', 'Москва', 'Тверская', '15', '22');

-- Пользователи с несколькими адресами
INSERT INTO address (user_id, zip_code, city, street, building, flat) VALUES
(6, '190000', 'СПб', 'Невский', '1', '10'),
(6, '190001', 'СПб', 'Лиговский', '5', '20'),

(7, '190002', 'СПб', 'Садовая', '8', '3'),
(7, '190003', 'СПб', 'Московский', '10', '15'),

(8, '620000', 'Екатеринбург', 'Ленина', '20', '7'),
(8, '620001', 'Екатеринбург', 'Малышева', '25', '9'),

(9, '630000', 'Новосибирск', 'Красный проспект', '11', '2'),
(9, '630001', 'Новосибирск', 'Советская', '6', '18'),

(10, '420000', 'Казань', 'Баумана', '9', '14'),
(10, '420001', 'Казань', 'Пушкина', '4', '6');
